#리스트
# f=[] #빈 리스트
# a=[90,92,84,88,74] #표기법[]
# b=list((90,92,84,88,74)) #list()함수
# c=["파이썬",[900, 30.5, "자바"],850,78.75]
# d=list(("파이썬",900, 30.5, "자바",850,78.75))
# e=list("프로그래밍") #문자열 -> 리스트
# print(a,b,c,d,e,f,sep="\n")

#인덱싱(해당index의 값 추출),
# 슬라이싱(특정 index범위의 값 추출)
#a=[90,91,92,93,94,95,96]
a=list(range(90,97))
print(a[0]) # [0,1,2,3,4,5,6] [0,...len-1]
print(a[-1]) #[-7,-6,-5,-4,-3,-2,-1] [-len,...,-1]
print(a[-7])

#
print(a[0:3]) # 0<=범위<3 => 0,1,2
print(a[3:5])
print(a[0:]) # 0<=범위<끝길이(전체)
print(a[:]) # 0<=범위<끝길이(전체)
print(a[3:]) # 3<=범위<끝길이
#a[시작:끝:증분]
print(a[1:5:2])
print(a[::2]) # 전체 인덱스 0부터 2씩증가
print(a[1::2]) # 1<=범위<끝길이, 2씩증가
print(a[-4:-2]) # -4<=범위<-2
print(a[-4:])
print(a[100]) # 범위를 벗어난 indexing
 # IndexError: list index out of range